# FilledRegion Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FilledRegion Class
Members See Also
---
A filled region element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class FilledRegion : Element
```

Visual Basic
---
```text
Public Class FilledRegion _
	Inherits Element
```

Visual C++
---
```text
public ref class FilledRegion : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..FilledRegion
# See Also
FilledRegion Members
Autodesk.Revit.DB Namespace